1. 카메라

 - 카메라(camera)는 레이더, 라이다를 통해 파악할 수 없는 정확한 형상정보를 파악할 수 있다는 점에서 ADAS 시스템에서 가장 기본이 되는 센서임. 교통 표지판 인식, 사각 지대 탐지, 차선 이탈 등을 판단하기 위해서는 카메라를 통한 정확한 데이터 분석이 필수

 - 스테레오(stereo) 방식의 카메라를 이용하면 렌즈 간 시각 차를 이용해 물체를 3차원으로 인지함으로써 형상정보에 거리정보까지 얻을 수 있다는 이점이 있으나, 가격도 상승하는 단점도 존재해 단안(mono) 카메라를 통해 여러 기능을 동시해 수행할 수 있도록 하기도 함.

 - 카메라 이미지 처리 기술을 기반으로 하는 모빌아이는 카메라 기반 이미지 처리 알고리즘과 ADAS 기능을 작동시키는 제품을 출시해왔는데, 최근 'EyeQ5'라는 이름의 차량용 프로세서를 발표

2. 레이더

- 레이더(Radio Detection And Ranging, Radar)는 허공에다 전자파를 쏜 다음, 어떤 물체에 부딪혀 돌아오는 반사파를 측정해 탐지된 물체의 방향, 거리,속도 등을 파악하는 시스템

- 전파를 이용하기 때문에 기상환경이나 밤낮을 구별하지 않고 안정적으로 거리 측정을 할 수 있어 카메라를 보완하는 역할을 함.

- 레이더는 측정 거리와 측정 각도를 동시에 늘리는 게 어렵기 때문에 ADAS 기능에 따라 장거리용 레이더와 중·단거리용 레이더로 나누어 적용됨.

- 기술 측면에서 차량용 레이더는 데이터의 정확성을 높이기 위해 측정 거리와 측정 각도, 전파의 주파수 대역 폭 확대를 목표로 발전하고 있는 한편 경량화, 소형화, 저가화를 위한 노력도 지속 중

3. 라이다

 - 라이다(Light Detection And Ranging, LiDAR)는 레이더와 기본 원리는 같으나 발사하고 수신하는 대상이 전파가 아니라 고출력의 펄스 레이저를 이용해 거리 정보를 획득한다는 점이 다름.

 - 라이다 센서에서 끊임없이 레이저 광선을 쏘아 되돌아오는 속도를 측정함. 실제 거리를 계산하는데 1초에 수백만 번의 광선을 쏘기 때문에 이를 모두 합쳐서 3D로 시각 정보를 재구성하는 것이 가능해짐.

 - 초기 미국 달 탐사에서 달의 지형을 알아내기 위해 사용되는 등 지리학적으로 활용됐던 라이다가 처음 자동차에 사용된 것은 2005년 미 국방부 자율주행차 경진대회인 다르파(DARPA)로 해당 자동차인 스탠리(Stanley, 스탠포드 대학과 폭스바겐이 공동으로 만든 자율주행차량)는 5개의 Sick사 라이다를 차량 지붕에 설치해 우승했는데, 이 무렵부터 현재 대표 라이다 회사인 벨로다인(Velodyne)이 라이다에 관심을 갖고 개발과 활용에 뛰어들게 됨.
